In [2]:
import numpy as np
import pandas as pd

## Немного ни о чем

In [1]:
# our code

## Задачи

**1. Given series A and series B**

In [178]:
series_a = pd.Series([1, 2, 4, 3])
series_b = pd.Series([3, 4, 5, 6])

- Items is series A not present in series B
- Intersection of series
- Items presented only in one of the series, not in both

In [180]:
# your code

**2. Reverse all rows (first row should become last etc.)**

In [232]:
df = pd.DataFrame(np.arange(30).reshape(-1, 6), columns=map(lambda x: f'column_{x}', range(6)))

In [233]:
df

   column_0  column_1  column_2  column_3  column_4  column_5
0         0         1         2         3         4         5
1         6         7         8         9        10        11
2        12        13        14        15        16        17
3        18        19        20        21        22        23
4        24        25        26        27        28        29

In [234]:
# your code

**3. Get column name with the highest number of row-wise maximum’s in dataframe**

In [237]:
df = pd.DataFrame(np.random.randint(0, 100, 50).reshape(-1, 5), columns=map(lambda x: f'column_{x}', range(5)))

In [238]:
df

   column_0  column_1  column_2  column_3  column_4
0        10        80        16         7        78
1        27        91        48        27         4
2        85        94        14        94         6
3        49        11        32        11        73
4        28        92        64        11        16
5        48        20        56        89        45
6        70        99         5        42        33
7        60        53        97        70        71
8        48        99        54        30        30
9        74        44        65        27        86

In [239]:
# your code

**4. Find the positions of numbers that are multiples of N**

In [240]:
N = 5

In [290]:
df

   column_0  column_1  column_2  column_3  column_4
0        10        80        16         7        78
1        27        91        48        27         4
2        85        94        14        94         6
3        49        11        32        11        73
4        28        92        64        11        16
5        48        20        56        89        45
6        70        99         5        42        33
7        60        53        97        70        71
8        48        99        54        30        30
9        74        44        65        27        86

For each column Series separately

In [291]:
# your code

```
column_0: [0, 2, 6, 7]
column_1: [0, 5]
column_2: [6, 9]
column_3: [7, 8]
column_4: [5, 8]
```

Now try to treat rows and columns as coordinates. Return list (or array) of pairs for such elements. (one-liner)

In [293]:
# your code

```[[0, 0],
 [0, 1],
 [2, 0],
 [5, 1],
 [5, 4],
 [6, 0],
 [6, 2],
 [7, 0],
 [7, 3],
 [8, 3],
 [8, 4],
 [9, 2]]
 ```

**5. Compute the minimum-by-maximum for every row of dataframe**

In [302]:
# your code

**6. Normalize all columns of df by subtracting the column mean and divide by standard deviation.**

In [303]:
# your code

**7. Range all columns of df such that the minimum value in each column is 0 and max is 1**

In [304]:
# your code

**8. Create a column that contains the second-largest value in each row?**

In [305]:
# your code

In [ ]:
out = df.apply(lambda x: x.sort_values().unique()[-2], axis=1)

**9. Split a text column into two separate columns?**

In [ ]:
df_text = pd.DataFrame(
    {
        'row':
        [
            'id\t Name, Surname',
            '2\t Nadal, Raphael',
            '5\t Djokovic,  Novak',
            '1\t Federer, Roger'
        ]
    }
)

In [3]:
# your code

In [345]:
splitted_df

0     Name   Surname
id
13    John       Doe
431   Иван    Иванов
42    Jane      Null

---